docs/site/yoder10_perfor_pract_inter_music_clarin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>yoder10_perfor_pract_inter_music_clarin</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">yoder10_perfor_pract_inter_music_clarin</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3c6175f">Performance Practice of Interactive Music for  Clarinet and Computer</a>
<ul>
<li><a href="#org42b33d2">Reluctance</a></li>
<li><a href="#orgb807250">Performance Practice</a></li>
<li><a href="#orga19d441">History</a></li>
<li><a href="#org8ff90bc">Two schools</a></li>
<li><a href="#orgc38d053">multichannel</a></li>
<li><a href="#orgae4f6b1">concert music</a></li>
<li><a href="#org3dde9fe">Computers</a></li>
<li><a href="#org1462674">MIDI</a></li>
<li><a href="#org6427afc">Max/MSP and 4X</a></li>
<li><a href="#orge2cef4f">MSP</a></li>
<li><a href="#org73851fc">Interactive works</a></li>
<li><a href="#orgf0ea482">philosophy</a></li>
<li><a href="#orgb2daa04">Overview of Rowe</a></li>
<li><a href="#org26f01d6">Other systems</a></li>
<li><a href="#orga7ce775">PP</a></li>
<li><a href="#org1ce5697">The Score</a></li>
<li><a href="#orge087f1f">Performance vs Study Scores</a></li>
<li><a href="#orgc279b81">Score</a></li>
<li><a href="#orgae650fb">Amplification</a></li>
<li><a href="#org929cfdf">Mic choice</a></li>
<li><a href="#org6cbdf06">Mic use</a></li>
<li><a href="#orgf1827cf">Speaker positioning</a></li>
<li><a href="#orgb683d7d">Approach 2</a></li>
<li><a href="#org43c0db8">Score following</a></li>
<li><a href="#org03d9bcb">Pedals</a></li>
<li><a href="#orga5c0b4b">Assistants</a></li>
<li><a href="#org49a19f7">Musical Function</a></li>
<li><a href="#orgbe4fcb6">Conclusions</a></li>
<li><a href="#org712b0c4">More conclusions</a></li>
<li><a href="#orge2b0e0a">Outlook</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3c6175f" class="outline-2">
<h2 id="org3c6175f">Performance Practice of Interactive Music for  Clarinet and Computer</h2>
<div class="outline-text-2" id="text-org3c6175f">
</div>
<div id="outline-container-org42b33d2" class="outline-3">
<h3 id="org42b33d2">Reluctance</h3>
<div class="outline-text-3" id="text-org42b33d2">
<p>
<code>"many performers are reluctant to approach these works due to unfamiliarity with the genre and its technical and musical considerations."</code>
</p>
</div>
</div>
<div id="outline-container-orgb807250" class="outline-3">
<h3 id="orgb807250">Performance Practice</h3>
<div class="outline-text-3" id="text-orgb807250">
<p>
Performance practice traditionally has dealt with the written score, but needs to expand to include computer software, technology, microphones, pedals, etc.
</p>

<p>
Interactive music requires specific knowledge and skills that performers may not encounter in other genres of contemporary music.
Microphone technique, spatialization, sound processing, improvisation
</p>

<p>
PP is often solved with close collaboration between composer and performer, but doesn't get spread to new performers
</p>
</div>
</div>
<div id="outline-container-orga19d441" class="outline-3">
<h3 id="orga19d441">History</h3>
<div class="outline-text-3" id="text-orga19d441">
<p>
Early pioneers were Varese, Busoni, and Italian Futurists. Timbre was most important, including noise, nature sounds, etc.
</p>
</div>
</div>
<div id="outline-container-org8ff90bc" class="outline-3">
<h3 id="org8ff90bc">Two schools</h3>
<div class="outline-text-3" id="text-org8ff90bc">
<p>
French created musique concrete
German like Stockhausen dealt with sound synthesis and processing electronic sound
</p>
</div>
</div>
<div id="outline-container-orgc38d053" class="outline-3">
<h3 id="orgc38d053">multichannel</h3>
<div class="outline-text-3" id="text-orgc38d053">
<p>
Development of multichannel in the 1960s to create spatialization
</p>
</div>
</div>
<div id="outline-container-orgae4f6b1" class="outline-3">
<h3 id="orgae4f6b1">concert music</h3>
<div class="outline-text-3" id="text-orgae4f6b1">
<p>
by 1960 many composers found performance of tape music lacking, and created works for musician + tape
Wasn't really active, although good performers could make it seem that way
</p>
</div>
</div>
<div id="outline-container-org3dde9fe" class="outline-3">
<h3 id="org3dde9fe">Computers</h3>
<div class="outline-text-3" id="text-org3dde9fe">
<p>
Signal processing of computers made old hardware things possible on software. Computers offered textural complexity, rhythmic precision, and control over everything.
</p>

<p>
Access to these was not easy early on because of size, cost, and expertise. That didn't come until the 80
</p>
</div>
</div>
<div id="outline-container-org1462674" class="outline-3">
<h3 id="org1462674">MIDI</h3>
<div class="outline-text-3" id="text-org1462674">
<p>
Midi came in 1982 to make communication easier. This combined with computers to create systems like Cypher, Kyma, and Max.
</p>
</div>
</div>
<div id="outline-container-org6427afc" class="outline-3">
<h3 id="org6427afc">Max/MSP and 4X</h3>
<div class="outline-text-3" id="text-org6427afc">
<p>
max was created at IRCAM and has become the most popular. Initially the program was to control the 4X synthesizer, and was used in the early interactive pieces from ircam.
</p>
</div>
</div>
<div id="outline-container-orge2cef4f" class="outline-3">
<h3 id="orge2cef4f">MSP</h3>
<div class="outline-text-3" id="text-orge2cef4f">
<p>
MSP came to max in 1997.
</p>

<p>
It has grown and many composers use it now.
</p>
</div>
</div>
<div id="outline-container-org73851fc" class="outline-3">
<h3 id="org73851fc">Interactive works</h3>
<div class="outline-text-3" id="text-org73851fc">
<p>
<code>Interactive composition offers the combination of the best human qualities of a live performer (gestural nuance, stage presence, character) with the best machine qualities of a computer (infinite sound possibilities, instant processing, rapid calculations).</code>
</p>

<p>
<code>Electronics can extend the sound world of the live performer, while the performer can communicate musical understanding to an audience, eliminating the detachment and isolation of the typical electroacoustic performance.</code> quoted in <a href="cite:&amp;rowe93_inter_music_system">cite:&amp;rowe93_inter_music_system</a> page 5 or <a href="cite:&amp;garnett01_aesth_inter_comput_music">cite:&amp;garnett01_aesth_inter_comput_music</a> page 32
</p>
</div>
</div>
<div id="outline-container-orgf0ea482" class="outline-3">
<h3 id="orgf0ea482">philosophy</h3>
<div class="outline-text-3" id="text-orgf0ea482">
<p>
<code>Philosophical territory explored by interactive composition is a fundamental theme of life in the twenty-first century: the question of the nature of our relationship to machines, computers, and artificial intelligence systems.</code> quoted from Brian Belet, "Live Performance Interaction for Humans and Machines in the Early Twenty-First Century: One Composer's Aesthetics for Composition and Performance Practice" Organized Sound 8 (December 2003): 306.
</p>
</div>
</div>
<div id="outline-container-orgb2daa04" class="outline-3">
<h3 id="orgb2daa04">Overview of Rowe</h3>
<div class="outline-text-3" id="text-orgb2daa04">
</div>
</div>
<div id="outline-container-org26f01d6" class="outline-3">
<h3 id="org26f01d6">Other systems</h3>
<div class="outline-text-3" id="text-org26f01d6">
<p>
Kyma - very expensive but has external hardware for dsp called a pacarana
</p>

<p>
chuck, supercollider
</p>
</div>
</div>
<div id="outline-container-orga7ce775" class="outline-3">
<h3 id="orga7ce775">PP</h3>
<div class="outline-text-3" id="text-orga7ce775">
<p>
The numerous roles the performer has to fill goes beyond what is required in 18th, 19th, and 20th century works.
</p>
</div>
</div>
<div id="outline-container-org1ce5697" class="outline-3">
<h3 id="org1ce5697">The Score</h3>
<div class="outline-text-3" id="text-org1ce5697">
<p>
Notation is similar to 20th century work, graphical notation, complex rhythms, extended techniques, etc. However the computer part is something unique and new and inconsistent. Some options are staff notation, graphic notation, or textual descriptions.
</p>
</div>
</div>
<div id="outline-container-orge087f1f" class="outline-3">
<h3 id="orge087f1f">Performance vs Study Scores</h3>
<div class="outline-text-3" id="text-orge087f1f">
<p>
Some performers like having two versions, the study score with as much info as possible and the performance score for easier page turns <b>paraphrasing a Luara Carmichael quote</b>
</p>
</div>
</div>
<div id="outline-container-orgc279b81" class="outline-3">
<h3 id="orgc279b81">Score</h3>
<div class="outline-text-3" id="text-orgc279b81">
<p>
<code>In interactive music, the notated score often only tells part of the story; the rest of the "score" is hidden inside of Max patches and lines of code.</code>
</p>
</div>
</div>
<div id="outline-container-orgae650fb" class="outline-3">
<h3 id="orgae650fb">Amplification</h3>
<div class="outline-text-3" id="text-orgae650fb">
<p>
Following the Stockhausen quote, Yoder says the same responsibility applies to amplified, processed, and playback sound. Working with sound engineers can help
</p>
</div>
</div>
<div id="outline-container-org929cfdf" class="outline-3">
<h3 id="org929cfdf">Mic choice</h3>
<div class="outline-text-3" id="text-org929cfdf">
<p>
If the sound is very processed, close dynamic mics or contact mics can help prevent feedback. If the sound is to amplify the beautiful and pure clarinet, then having high quality mics is important. <b>paraphrasing a Laura Carmichael block quote</b>
</p>
</div>
</div>
<div id="outline-container-org6cbdf06" class="outline-3">
<h3 id="org6cbdf06">Mic use</h3>
<div class="outline-text-3" id="text-org6cbdf06">
<p>
From McNutt (unsure if I used it already) Acoustic musicians are rarely trained to work with microphones. Using it effectively requires practice and experience. It can expand sound, and make quiet sounds audible. It can be used for disembodied sound, or amplification of private sounds like breathing and key noise. <b>probably too close of a paraphrase</b>
</p>
</div>
</div>
<div id="outline-container-orgf1827cf" class="outline-3">
<h3 id="orgf1827cf">Speaker positioning</h3>
<div class="outline-text-3" id="text-orgf1827cf">
<p>
Two approaches, the recreation of studio sound where th espeakres are often in front of the performer pointing away. Musicians will usually need a monitor. An angle can help protect the performers ears
</p>
</div>
</div>
<div id="outline-container-orgb683d7d" class="outline-3">
<h3 id="orgb683d7d">Approach 2</h3>
<div class="outline-text-3" id="text-orgb683d7d">
<p>
This is to put the speakers onstage with the player, and the sound comes from the player
</p>

<p>
Both approaches can work depending on the piece.
</p>
</div>
</div>
<div id="outline-container-org43c0db8" class="outline-3">
<h3 id="org43c0db8">Score following</h3>
<div class="outline-text-3" id="text-org43c0db8">
<p>
Score following is freeing, but often unreliable. Pitch tracking alone has issues because of the harmnoic spectrum, and doesn't deal well with multiphonics etc. And it is always vulnerable to performer error
</p>
</div>
</div>
<div id="outline-container-org03d9bcb" class="outline-3">
<h3 id="org03d9bcb">Pedals</h3>
<div class="outline-text-3" id="text-org03d9bcb">
<p>
Many like the pedal, but some like Kimura don't. It can create a visual distraction, or a performer can push a pedal twice or miss it
</p>
</div>
</div>
<div id="outline-container-orga5c0b4b" class="outline-3">
<h3 id="orga5c0b4b">Assistants</h3>
<div class="outline-text-3" id="text-orga5c0b4b">
<p>
Some like sound engineers, projectionists, technologists, or collaborative partners. Can they read a score? Can they run a mixer? Do they have good musical instincts?
</p>
</div>
</div>
<div id="outline-container-org49a19f7" class="outline-3">
<h3 id="org49a19f7">Musical Function</h3>
<div class="outline-text-3" id="text-org49a19f7">
<p>
Just like when playing with a piano, you may try and evoke different things. Similarly with electronics you have to ask questions like, am I foreground or background? Overpowered or fighting? Harsh articulations to match electronics? What is the character?
</p>
</div>
</div>
<div id="outline-container-orgbe4fcb6" class="outline-3">
<h3 id="orgbe4fcb6">Conclusions</h3>
<div class="outline-text-3" id="text-orgbe4fcb6">
<p>
Study scores vs performance scores
Interface is often neglected.
</p>
</div>
</div>
<div id="outline-container-org712b0c4" class="outline-3">
<h3 id="org712b0c4">More conclusions</h3>
<div class="outline-text-3" id="text-org712b0c4">
<p>
Many performers avoid the rep because it is difficult, costly, and unfamiliar. This is changing and is not insurmountable. Computers that can handle this are cheaper and cheaper, interface design is improving, open source pd has emerged (and free max runtime)
Barriers are coming down. It is time to consider formal courses of instruction for performers at universities. 
</p>
</div>
</div>
<div id="outline-container-orge2b0e0a" class="outline-3">
<h3 id="orge2b0e0a">Outlook</h3>
<div class="outline-text-3" id="text-orge2b0e0a">
<p>
Collaboration could come between composition department and vocal/instrumental studios
Positive outlook. More and more performers will be drawn to it. Graduate specializations may come. It is a compelling genre.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
